---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternTableIterator.MoveNext
source: html/1f14ae46-328e-fc3b-d642-6be96f090a2f.htm
---
# Autodesk.Revit.DB.ExportPatternTableIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this iterator.
 False if the iterator has completed all available items.